grevaillot/svd_tools/headers/STM32F407/dma1.h
#pragma once 

/* --- DMA1: DMA controller ----------------------------------------- */

/** @defgroup dma1_registers DMA controller Register
@{*/

/** DMA1_LISR low interrupt status register **/
#define DMA1_LISR			MMIO32(DMA1_BASE + 0x00)
/** DMA1_HISR high interrupt status register **/
#define DMA1_HISR			MMIO32(DMA1_BASE + 0x04)
/** DMA1_LIFCR low interrupt flag clear register **/
#define DMA1_LIFCR			MMIO32(DMA1_BASE + 0x08)
/** DMA1_HIFCR high interrupt flag clear register **/
#define DMA1_HIFCR			MMIO32(DMA1_BASE + 0x0c)
/** DMA1_S0CR stream x configuration register **/
#define DMA1_S0CR			MMIO32(DMA1_BASE + 0x10)
/** DMA1_S0NDTR stream x number of data register **/
#define DMA1_S0NDTR			MMIO32(DMA1_BASE + 0x14)
/** DMA1_S0PAR stream x peripheral address register **/
#define DMA1_S0PAR			MMIO32(DMA1_BASE + 0x18)
/** DMA1_S0M0AR stream x memory 0 address register **/
#define DMA1_S0M0AR			MMIO32(DMA1_BASE + 0x1c)
/** DMA1_S0M1AR stream x memory 1 address register **/
#define DMA1_S0M1AR			MMIO32(DMA1_BASE + 0x20)
/** DMA1_S0FCR stream x FIFO control register **/
#define DMA1_S0FCR			MMIO32(DMA1_BASE + 0x24)
/** DMA1_S1CR stream x configuration register **/
#define DMA1_S1CR			MMIO32(DMA1_BASE + 0x28)
/** DMA1_S1NDTR stream x number of data register **/
#define DMA1_S1NDTR			MMIO32(DMA1_BASE + 0x2c)
/** DMA1_S1PAR stream x peripheral address register **/
#define DMA1_S1PAR			MMIO32(DMA1_BASE + 0x30)
/** DMA1_S1M0AR stream x memory 0 address register **/
#define DMA1_S1M0AR			MMIO32(DMA1_BASE + 0x34)
/** DMA1_S1M1AR stream x memory 1 address register **/
#define DMA1_S1M1AR			MMIO32(DMA1_BASE + 0x38)
/** DMA1_S1FCR stream x FIFO control register **/
#define DMA1_S1FCR			MMIO32(DMA1_BASE + 0x3c)
/** DMA1_S2CR stream x configuration register **/
#define DMA1_S2CR			MMIO32(DMA1_BASE + 0x40)
/** DMA1_S2NDTR stream x number of data register **/
#define DMA1_S2NDTR			MMIO32(DMA1_BASE + 0x44)
/** DMA1_S2PAR stream x peripheral address register **/
#define DMA1_S2PAR			MMIO32(DMA1_BASE + 0x48)
/** DMA1_S2M0AR stream x memory 0 address register **/
#define DMA1_S2M0AR			MMIO32(DMA1_BASE + 0x4c)
/** DMA1_S2M1AR stream x memory 1 address register **/
#define DMA1_S2M1AR			MMIO32(DMA1_BASE + 0x50)
/** DMA1_S2FCR stream x FIFO control register **/
#define DMA1_S2FCR			MMIO32(DMA1_BASE + 0x54)
/** DMA1_S3CR stream x configuration register **/
#define DMA1_S3CR			MMIO32(DMA1_BASE + 0x58)
/** DMA1_S3NDTR stream x number of data register **/
#define DMA1_S3NDTR			MMIO32(DMA1_BASE + 0x5c)
/** DMA1_S3PAR stream x peripheral address register **/
#define DMA1_S3PAR			MMIO32(DMA1_BASE + 0x60)
/** DMA1_S3M0AR stream x memory 0 address register **/
#define DMA1_S3M0AR			MMIO32(DMA1_BASE + 0x64)
/** DMA1_S3M1AR stream x memory 1 address register **/
#define DMA1_S3M1AR			MMIO32(DMA1_BASE + 0x68)
/** DMA1_S3FCR stream x FIFO control register **/
#define DMA1_S3FCR			MMIO32(DMA1_BASE + 0x6c)
/** DMA1_S4CR stream x configuration register **/
#define DMA1_S4CR			MMIO32(DMA1_BASE + 0x70)
/** DMA1_S4NDTR stream x number of data register **/
#define DMA1_S4NDTR			MMIO32(DMA1_BASE + 0x74)
/** DMA1_S4PAR stream x peripheral address register **/
#define DMA1_S4PAR			MMIO32(DMA1_BASE + 0x78)
/** DMA1_S4M0AR stream x memory 0 address register **/
#define DMA1_S4M0AR			MMIO32(DMA1_BASE + 0x7c)
/** DMA1_S4M1AR stream x memory 1 address register **/
#define DMA1_S4M1AR			MMIO32(DMA1_BASE + 0x80)
/** DMA1_S4FCR stream x FIFO control register **/
#define DMA1_S4FCR			MMIO32(DMA1_BASE + 0x84)
/** DMA1_S5CR stream x configuration register **/
#define DMA1_S5CR			MMIO32(DMA1_BASE + 0x88)
/** DMA1_S5NDTR stream x number of data register **/
#define DMA1_S5NDTR			MMIO32(DMA1_BASE + 0x8c)
/** DMA1_S5PAR stream x peripheral address register **/
#define DMA1_S5PAR			MMIO32(DMA1_BASE + 0x90)
/** DMA1_S5M0AR stream x memory 0 address register **/
#define DMA1_S5M0AR			MMIO32(DMA1_BASE + 0x94)
/** DMA1_S5M1AR stream x memory 1 address register **/
#define DMA1_S5M1AR			MMIO32(DMA1_BASE + 0x98)
/** DMA1_S5FCR stream x FIFO control register **/
#define DMA1_S5FCR			MMIO32(DMA1_BASE + 0x9c)
/** DMA1_S6CR stream x configuration register **/
#define DMA1_S6CR			MMIO32(DMA1_BASE + 0xa0)
/** DMA1_S6NDTR stream x number of data register **/
#define DMA1_S6NDTR			MMIO32(DMA1_BASE + 0xa4)
/** DMA1_S6PAR stream x peripheral address register **/
#define DMA1_S6PAR			MMIO32(DMA1_BASE + 0xa8)
/** DMA1_S6M0AR stream x memory 0 address register **/
#define DMA1_S6M0AR			MMIO32(DMA1_BASE + 0xac)
/** DMA1_S6M1AR stream x memory 1 address register **/
#define DMA1_S6M1AR			MMIO32(DMA1_BASE + 0xb0)
/** DMA1_S6FCR stream x FIFO control register **/
#define DMA1_S6FCR			MMIO32(DMA1_BASE + 0xb4)
/** DMA1_S7CR stream x configuration register **/
#define DMA1_S7CR			MMIO32(DMA1_BASE + 0xb8)
/** DMA1_S7NDTR stream x number of data register **/
#define DMA1_S7NDTR			MMIO32(DMA1_BASE + 0xbc)
/** DMA1_S7PAR stream x peripheral address register **/
#define DMA1_S7PAR			MMIO32(DMA1_BASE + 0xc0)
/** DMA1_S7M0AR stream x memory 0 address register **/
#define DMA1_S7M0AR			MMIO32(DMA1_BASE + 0xc4)
/** DMA1_S7M1AR stream x memory 1 address register **/
#define DMA1_S7M1AR			MMIO32(DMA1_BASE + 0xc8)
/** DMA1_S7FCR stream x FIFO control register **/
#define DMA1_S7FCR			MMIO32(DMA1_BASE + 0xcc)

/**@}*/


/** @defgroup dma1_lisr LISR low interrupt status register
@{*/

/** DMA1_LISR_TCIF3 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LISR_TCIF3		(1 << 27)
/** DMA1_LISR_HTIF3 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA1_LISR_HTIF3		(1 << 26)
/** DMA1_LISR_TEIF3 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA1_LISR_TEIF3		(1 << 25)
/** DMA1_LISR_DMEIF3 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA1_LISR_DMEIF3		(1 << 24)
/** DMA1_LISR_FEIF3 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA1_LISR_FEIF3		(1 << 22)
/** DMA1_LISR_TCIF2 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LISR_TCIF2		(1 << 21)
/** DMA1_LISR_HTIF2 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA1_LISR_HTIF2		(1 << 20)
/** DMA1_LISR_TEIF2 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA1_LISR_TEIF2		(1 << 19)
/** DMA1_LISR_DMEIF2 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA1_LISR_DMEIF2		(1 << 18)
/** DMA1_LISR_FEIF2 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA1_LISR_FEIF2		(1 << 16)
/** DMA1_LISR_TCIF1 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LISR_TCIF1		(1 << 11)
/** DMA1_LISR_HTIF1 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA1_LISR_HTIF1		(1 << 10)
/** DMA1_LISR_TEIF1 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA1_LISR_TEIF1		(1 << 9)
/** DMA1_LISR_DMEIF1 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA1_LISR_DMEIF1		(1 << 8)
/** DMA1_LISR_FEIF1 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA1_LISR_FEIF1		(1 << 6)
/** DMA1_LISR_TCIF0 Stream x transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LISR_TCIF0		(1 << 5)
/** DMA1_LISR_HTIF0 Stream x half transfer interrupt flag (x=3..0) **/
#define DMA1_LISR_HTIF0		(1 << 4)
/** DMA1_LISR_TEIF0 Stream x transfer error interrupt flag (x=3..0) **/
#define DMA1_LISR_TEIF0		(1 << 3)
/** DMA1_LISR_DMEIF0 Stream x direct mode error interrupt flag (x=3..0) **/
#define DMA1_LISR_DMEIF0		(1 << 2)
/** DMA1_LISR_FEIF0 Stream x FIFO error interrupt flag (x=3..0) **/
#define DMA1_LISR_FEIF0		(1 << 0)

/**@}*/

/** @defgroup dma1_hisr HISR high interrupt status register
@{*/

